Documents/ПолучениеОтПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПолучениеОтПодрядчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзделияУПодрядчикаПлан</xr:Item>
				<xr:Item>AccumulationRegister.ИзделияУПодрядчика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИзделияУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИзделияУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИзделияУПодрядчикаПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзделияУПодрядчикаПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВозвратаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозвратаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПолучениеОтПодрядчика/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ИзделияУПодрядчика Расход
	Движения.ИзделияУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчика.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.Количество = 1;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияУПодрядчикаОстатки.ИзделиеЭлемент КАК ИзделиеЭлемент,
		|	ИзделияУПодрядчикаОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИзделияУПодрядчика.Остатки(&МоментВремени, ИзделиеЭлемент В (&ИзделияЭлемент)) КАК ИзделияУПодрядчикаОстатки
		|ГДЕ
		|	ИзделияУПодрядчикаОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ИзделияЭлемент", ИзделияЭлемент.ВыгрузитьКолонку("ИзделиеЭлемент"));
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Отказ = Истина;
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			стрОшибка = "Изделие "; 
		Иначе
			стрОшибка = "Изделия: "; 
		КонецЕсли;
		
		флПервоеИзделие = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если флПервоеИзделие Тогда
				флПервоеИзделие = НЕ флПервоеИзделие;
			Иначе
			    стрОшибка = стрОшибка + ", ";
			КонецЕсли;
			стрОшибка = стрОшибка + """" +ВыборкаДетальныеЗаписи.ИзделиеЗаказчика + """";
		КонецЦикла;
		Сообщить(стрОшибка + " не находятся у подрядчика " + Подрядчик,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли; 
	
	
	// регистр ИзделияУПодрядчикаПлан 
	
	Движения.ИзделияУПодрядчикаПлан.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчикаПлан.Добавить();
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.ДатаВозвратаФакт = Дата;
	КонецЦикла;

КонецПроцедуры
